OdGiDrawable.regenSupportFlags
\details
Retrieves a set of flags that represents the multi-threaded rendering support of this entity.
\returns
Returns 0 if the drawable can be rendered only in a single threaded mode.
\remarks
The default implementation of this function returns flags defined with the OdRxClass::customFlags() method.

OdGiDrawable.getGeomExtents(OdGeExtents3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves a WCS bounding box that represents the extents of this entity.
\param extents [out]  Receives the WCS extents.
\returns
Returns eOk if successful or an appropriate error code if not.
\remarks
The default implementation of this function always returns eInvalidExtents.

OdGiDrawable.viewportDrawLogicalFlags(OdGiViewportDraw*)
\details
Retrieves the setAttributes flags for the current viewportDraw.
\param pVd [in]  Pointer to OdGiViewportDraw interface.
\returns
0 in default implementation, must return setAttributes flags for the specified viewportDraw.
\remarks
The default implementation of this function always returns 0.

OdGiDrawable.gsNode
\details
Retrieves the OdGsCache associated with this object.
\returns
Pointer to the OdGsCache that represents cache associated with this object.

OdGiDrawable.setGsNode(OdGsCache*)
\details
Assigns the specified OdGsCache to this object.
\param pGsNode [in]  Pointer to the OdGsCache to be assigned.

OdGiDrawable.id
\details
Retrieves the database ID of this object.
\returns
pointer to OdDbStub which represents a database identifier of this object.
\remarks
Returns a null pointer if this object is not persistent.

OdGiDrawable.isPersistent
\details
Checks whether this object is persistent (stored in a database).
\returns
true this object is persistent (stored in a database), false otherwise.

OdGiDrawable.viewportDraw(OdGiViewportDraw*)
\details
Creates a viewport-dependent geometric representation of this object.
\remarks
Causes OdGiDrawable to describe its geometry to the specified OdGiViewportDraw object.
This function is called once per viewport.
\remarks
By overriding this function, it is possible to have totally different images in each viewport; a schematic
in one viewport, a layout in another.
The default implementation of this function does nothing. This function can be
overridden in custom classes.
\param pVd [in]  Pointer to the OdGiViewportDraw interface.

OdGiDrawable.worldDraw(OdGiWorldDraw*)
\details
Creates a viewport-independent geometric representation of this object.
\returns
Returns true if and only if the geometric representation can be generated in a
viewport-independent manner.
\remarks
A return value of false indicates that viewportDraw() must be called for this object.
The 3D GS will call this function at least once but may cache subsequent display updates.
Use OdGsModel::onModified() to ensure that the 3D GS will call worldDraw() for next display update.
The default implementation does nothing but return true. This function can be
overridden in custom classes.
\param pWd [in]  Pointer to the OdGiWorldDraw interface.

OdGiDrawable.setAttributes(OdGiDrawableTraits*)
\details
Sets the vectorization attributes of this object, and returns its attribute flags.
\param pTraits [in]  Pointer to OdGiDrawableTraits object from and to which the attributes are to be set.
\remarks
This function is called by the vectorization framework, prior to calling worldDraw() or
viewportDraw(), to set the attributes for an object.
\sa
SetAttributesFlags

OdGiDrawable.drawableType
\details
Retrieves a type of this drawable.
\returns
value from the DrawableType enumeration that represents one of the drawable types.